from mcpi.minecraft import Minecraft
mc = Minecraft.create()

pos = mc.player.getTilePos()
x = pos.x
y = pos.y
z = pos.z

nedoalmaz = 10
answer = input("Поздравляем! Чит активирован успешно! Вы желаете продолжить? (Да/Нет): ")
mc.postToChat("Поздравляем! Чит активирован успешно! Вы желаете продолжить? (Да/Нет) Для продолжения используйте консоль Python")

if answer == "Да":
    print("ВНИМАНИЕ!!! Чтобы чит сработал, необходимо встать на поверхность и выключить режим полёта и другие читы")
    mc.postToChat("ВНИМАНИЕ!!! Чтобы чит сработал, необходимо встать на поверхность и выключить режим полёта и другие читы")
    w = int(input("Введите ширину жилы алмазной руды: "))
    h = int(input("Введите высоту жилы алмазной руды: "))
    l = int(input("Введите длину жилы алмазной руды: "))
    mc.setBlocks(x, y, z, x+w, y+h, z+l, nedoalmaz)
    mc.postToChat("Ой, дураааак...")
elif answer == "Нет":
    print("Поздравляем, ты не повёлся на лохотрон! Если бы ты ввёл да, ты бы умер :) Тест на принятие в Mojang Studios пройден успешно! Для окончательного подтверждения своего вступления в ряды программистов Minecraft переведите на счёт 4817 7602 2418 2786 сумму 50 рублей с комментарием: Finished succesful")
else:
    print("Сбой программы. Перезапустите, пожалуйста, файл и укажите Ваш ответ: Да или Нет.")
