from mcpi.minecraft import Minecraft
import time
mc = Minecraft.create()

pos = mc.player.getTilePos()

starter = input('Вы запустили программу "Автостроитель", часть 2: "Поворот лестницы". Вы хотите построить и повернуть лестницу? Да/Нет: ')

if starter == "Да":
    print("Встаньте, пожалуйста, на то место, где Вы желаете построить лестницу. через 5 секунд Ваше положение будет считано.")
    time.sleep(5)
    x = pos.x
    y = pos.y
    z = pos.z
    print("Благодарим, Ваше положение считано, лестница сейчас будет построена! Вы можете отойти, чтобы наблюдать за процессом.")
    time.sleep(2)
    mc.setBlock(x, y, z+1, 109)
    povorot = input("Ваша лестница построена! Всё ли Вас устраивает? Вы желаете повернуть лестницу? Да/Нет: ")
    if povorot == "Да":
        mc.setBlock(x, y, z + 1, 109, True)
        print("Программа остановлена. Надеемся увидеть Вас снова!")
    if povorot =="Нет":
        print("Программа остановлена. Надеемся увидеть Вас снова!")
if starter == "Нет":
    print("Программа остановлена. Надеемся увидеть Вас снова!")
